/******************************************************************************
Copyright (C) 2020 Querda Electronic Technology All Rights Reserved

This software and code can be freely used for study and research. 
For commercial purposes, please contact the owner for permission.

File  : EcuM.c      ECU management module
Author: Wander 
******************************************************************************/

/******************************************************************************
                                    头文件
******************************************************************************/
#include "Uart.h"

/******************************************************************************
                                    局部宏方法
******************************************************************************/

/******************************************************************************
                                局部常量定义&类型定义
******************************************************************************/

/******************************************************************************
                                    局部变量定义
******************************************************************************/


/******************************************************************************
* Function Name: Test_Init
* Description  : Mcu初始化
* Arguments    : None
* Return Value : None
******************************************************************************/
void Test_Init(void)
{
    Uart_transmit_string("hello world\r\n");
    Uart_transmit_string("Test_Init Success\r\n");
}

/******************************************************************************
* Function Name: Test_Task
* Description  : Mcu初始化
* Arguments    : None
* Return Value : None
******************************************************************************/
void Test_Task(void)
{
    Uart_transmit_string("hello world\r\n");
    Uart_transmit_string("Test_Init Success\r\n");
    
    vTaskDelay(100);
}
    